from docx import Document

# Завантаження шаблону
doc = Document("Шаблон_таблиці_для_заповнення.docx")
table = doc.tables[0]

# Приклад даних
rows = [
    ["Бейонсе Ноулз", "Поп-зірка", "Співачка"],
    ["Двейн Джонсон", "Актор", "Продюсер, реслер"],
    ["Тейлор Свіфт", "Кантрі/поп-зірка", "Авторка пісень"],
    ["Бред Пітт", "Актор", "Кінопродюсер"],
    ["Адель", "Співачка", "Композитор"]
]

# Заповнення
for row_data in rows:
    row = table.add_row().cells
    for i, val in enumerate(row_data):
        row[i].text = val

# Збереження результату
doc.save("Заповнений_документ.docx")




if __name__ == '__main__':
   pass